content/posts/reasons-not-to-use.md
+++
title = "Reasons Not To Use"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T23:29:16-07:00
slug = "reasons-not-to-use"
draft = false
+++

Reasons not to use popular products and services, just like on RMS's website

\## Reasons not to use Adobe


## Adobe uses the "software as a service" pattern which gives it complete control over who is allowed to use their software, and it can be revoked at any time, such as when a [government requires it](<https://www.theverge.com/2019/10/7/20904030/adobe-venezuela-photoshop-behance-us-sanctions>). With this licensing model, you never own what you're paying for, you're just renting it. {#adobe-uses-the-software-as-a-service-pattern-which-gives-it-complete-control-over-who-is-allowed-to-use-their-software-and-it-can-be-revoked-at-any-time-such-as-when-a-government-requires-it--https-www-dot-theverge-dot-com-2019-10-7-20904030-adobe-venezuela-photoshop-behance-us-sanctions--dot-with-this-licensing-model-you-never-own-what-you-re-paying-for-you-re-just-renting-it-dot}

\## Reasons not to use AT&T


## AT&T marketed "unlimited" data plans that were nonetheless throttled after reaching a certain threshold, for which they were rightfully [punished and ordered to refund $60 million](<https://arstechnica.com/tech-policy/2019/11/att-users-whose-unlimited-data-was-throttled-get-60-million-in-refunds/>). Right after that, they [forced customers to switch to more expensive data plans without asking them](<https://arstechnica.com/information-technology/2019/11/att-adds-10-to-smartphone-bills-for-customers-with-older-plans/>), presumably to make up for this loss. Broadband connections in USA are in general expensive and poor quality, as a result of local monopolies and lack of choices for consumers. {#at-and-t-marketed-unlimited-data-plans-that-were-nonetheless-throttled-after-reaching-a-certain-threshold-for-which-they-were-rightfully-punished-and-ordered-to-refund-60-million--https-arstechnica-dot-com-tech-policy-2019-11-att-users-whose-unlimited-data-was-throttled-get-60-million-in-refunds--dot-right-after-that-they-forced-customers-to-switch-to-more-expensive-data-plans-without-asking-them--https-arstechnica-dot-com-information-technology-2019-11-att-adds-10-to-smartphone-bills-for-customers-with-older-plans--presumably-to-make-up-for-this-loss-dot-broadband-connections-in-usa-are-in-general-expensive-and-poor-quality-as-a-result-of-local-monopolies-and-lack-of-choices-for-consumers-dot}

\## Reasons not to use Blizzard


## Blizzard [banned a player from a major tournament](<https://playhearthstone.com/en-us/blog/23179289/>) for offending the sensibilities of the Communist Party of China by [supporting the Hong Kong protests publicly](<https://www.pcgamer.com/blitzchung-removed-from-hearthstone-grandmasters-for-liberate-hong-kong-comments/>). Blizzard is partially owned by Tencent, which in turn is owned by the Chinese government. History shows that it is exceedingly easy to offend the Chinese government with Winnie the Pooh memes and other nonsense - we should not let oppressive governments dictate what we are allowed to express, especially abroad. {#blizzard-banned-a-player-from-a-major-tournament--https-playhearthstone-dot-com-en-us-blog-23179289--for-offending-the-sensibilities-of-the-communist-party-of-china-by-supporting-the-hong-kong-protests-publicly--https-www-dot-pcgamer-dot-com-blitzchung-removed-from-hearthstone-grandmasters-for-liberate-hong-kong-comments--dot-blizzard-is-partially-owned-by-tencent-which-in-turn-is-owned-by-the-chinese-government-dot-history-shows-that-it-is-exceedingly-easy-to-offend-the-chinese-government-with-winnie-the-pooh-memes-and-other-nonsense-we-should-not-let-oppressive-governments-dictate-what-we-are-allowed-to-express-especially-abroad-dot}

\## Reasons not to use Google


## Google's "Project Nightingale" [included buying sensitive health-related records](<https://www.bbc.com/news/technology-50388464>) about Americans who were not even notified about their data being up for sale or having been sold. Google promises that this data will not be combined with existing consumer data (presumably for targeting ads), but it surely will, and it will not be the first time Google has bought sensitive private data from another company. {#google-s-project-nightingale-included-buying-sensitive-health-related-records--https-www-dot-bbc-dot-com-news-technology-50388464--about-americans-who-were-not-even-notified-about-their-data-being-up-for-sale-or-having-been-sold-dot-google-promises-that-this-data-will-not-be-combined-with-existing-consumer-data--presumably-for-targeting-ads--but-it-surely-will-and-it-will-not-be-the-first-time-google-has-bought-sensitive-private-data-from-another-company-dot}

\## Reasons not to use Microsoft


## Microsoft uses confusing UI patterns to [coerce Windows users to create online accounts during installation](<https://www.zdnet.com/article/windows-10-users-fume-microsoft-wheres-our-local-account-option-gone/>) {#microsoft-uses-confusing-ui-patterns-to-coerce-windows-users-to-create-online-accounts-during-installation--https-www-dot-zdnet-dot-com-article-windows-10-users-fume-microsoft-wheres-our-local-account-option-gone}


## Microsoft [recorded private Skype conversations and Cortana commands and shared them with contractors without making any effort toward anonymizing them](<https://www.theguardian.com/technology/2020/jan/10/skype-audio-graded-by-workers-in-china-with-no-security-measures>), or asking the users for permission to record them. Security around these recordings was nonexistent. If you care about privacy, never use any programs that send your voice through third party servers, in particular Microsoft's. {#microsoft-recorded-private-skype-conversations-and-cortana-commands-and-shared-them-with-contractors-without-making-any-effort-toward-anonymizing-them--https-www-dot-theguardian-dot-com-technology-2020-jan-10-skype-audio-graded-by-workers-in-china-with-no-security-measures--or-asking-the-users-for-permission-to-record-them-dot-security-around-these-recordings-was-nonexistent-dot-if-you-care-about-privacy-never-use-any-programs-that-send-your-voice-through-third-party-servers-in-particular-microsoft-s-dot}


## Microsoft uses deliberately confusing UI patterns to [force Windows users to create online accounts, instead of local ones during system installation](<https://www.howtogeek.com/442609/confirmed-windows-10-setup-now-prevents-local-account-creation/>). Making local accounts is only possible if you disconnect the computer from the Internet, but [there are reasons to believe they will eventually force users to always use online Microsoft accounts](<https://www.bleepingcomputer.com/news/microsoft/microsoft-wants-to-do-away-with-windows-10-local-accounts/>) for greater insight into their activities. {#microsoft-uses-deliberately-confusing-ui-patterns-to-force-windows-users-to-create-online-accounts-instead-of-local-ones-during-system-installation--https-www-dot-howtogeek-dot-com-442609-confirmed-windows-10-setup-now-prevents-local-account-creation--dot-making-local-accounts-is-only-possible-if-you-disconnect-the-computer-from-the-internet-but-there-are-reasons-to-believe-they-will-eventually-force-users-to-always-use-online-microsoft-accounts--https-www-dot-bleepingcomputer-dot-com-news-microsoft-microsoft-wants-to-do-away-with-windows-10-local-accounts--for-greater-insight-into-their-activities-dot}

\## Reasons not to use Samsung


## Samsung was caught [rigging smartphone benchmarks, and reporting higher performance.](<https://www.androidpolice.com/2019/10/02/samsung-galaxy-s4-class-action-lawsuit/>) The court ordered them to pay $10 per person, which is insultingly low. {#samsung-was-caught-rigging-smartphone-benchmarks-and-reporting-higher-performance-dot--https-www-dot-androidpolice-dot-com-2019-10-02-samsung-galaxy-s4-class-action-lawsuit--the-court-ordered-them-to-pay-10-per-person-which-is-insultingly-low-dot}

\## Reasons not to use Tesla


## Tesla can [remotely disable many features of their cars after they're sold](<https://www.theverge.com/2020/2/6/21127243/tesla-model-s-autopilot-disabled-remotely-used-car-update>). This is reason enough to never buy them, as they can lose all value at the drop of a hat for any reason. {#tesla-can-remotely-disable-many-features-of-their-cars-after-they-re-sold--https-www-dot-theverge-dot-com-2020-2-6-21127243-tesla-model-s-autopilot-disabled-remotely-used-car-update--dot-this-is-reason-enough-to-never-buy-them-as-they-can-lose-all-value-at-the-drop-of-a-hat-for-any-reason-dot}
